In [1]:
import pandas as pd
import xlrd

In [2]:
df = pd.read_excel("Canada.xlsx")
df.columns.values

array(['Type', 'Coverage', 'OdName', 'AREA', 'AreaName', 'REG', 'RegName',
       'DEV', 'DevName', 1980, 1981, 1982, 1983, 1984, 1985, 1986, 1987,
       1988, 1989, 1990, 1991, 1992, 1993, 1994, 1995, 1996, 1997, 1998,
       1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008, 2009,
       2010, 2011, 2012, 2013], dtype=object)

In [5]:
df_new = df[['OdName', 'AreaName', 1980]].head().set_index('OdName')

In [6]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0

In [10]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [11]:
df_new.columns.values.tolist()  # 1980 is Integer

['AreaName', 1980]

In [12]:
df_new.index.values.tolist()   # 1 is Integrer

['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 1]

# Convert all Column Names into String

In [13]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [15]:
df_new.columns = df_new.columns.astype(str)  #Converted all column values into String

In [16]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [17]:
df_new.columns.values.tolist()  # 1980 is String

['AreaName', '1980']

# Convert All Index Values into String

In [18]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [19]:
df_new.index.values.tolist()  # 1 is Integer

['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', 1]

In [20]:
df_new.index = df_new.index.astype(str)

In [21]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [22]:
df_new.index.values.tolist()  # 1 is String

['Afghanistan', 'Albania', 'Algeria', 'American Samoa', 'Andorra', '1']

# Convert entire column Values into String

In [23]:
df_new

               AreaName  1980
OdName
Afghanistan        Asia    16
Albania          Europe     1
Algeria          Africa    80
American Samoa  Oceania     0
Andorra          Europe     0
1                  Asia    30

In [24]:
df_new["1980"].values.tolist()  # All values are Integer

[16, 1, 80, 0, 0, 30]

In [30]:
df_new["1980"] = df_new["1980"].astype(str)

In [31]:
df_new

               AreaName 1980
OdName
Afghanistan        Asia   16
Albania          Europe    1
Algeria          Africa   80
American Samoa  Oceania    0
Andorra          Europe    0
1                  Asia   30

In [32]:
df_new["1980"].values.tolist()  # All values are String

['16', '1', '80', '0', '0', '30']